/* 
 * File:   Lib_A_vtmr_virtual_timers.h
 * Author: m.isaev
 *
 * Created on 4 октября 2017 г., 9:33
 */

#ifndef LIB_A_VTMR_VIRTUAL_TIMERS_H
#define	LIB_A_VTMR_VIRTUAL_TIMERS_H

//******************************************************************************
// Секция include (подключаем заголовочные файлы используемых модулей)
#include <stdint.h>
#include <stdio.h>
#include <stdbool.h>
//******************************************************************************


//******************************************************************************
// Секция определения констант
//******************************************************************************


//******************************************************************************
// Секция определения типов

typedef struct {
    volatile uint32_t cnt;

	uint32_t *pHardCntHight,
	        *pHardCntLow;

	uint32_t hard32bitsCnt;

    enum {
        STOP,
        RUNNING,
        PAUSE,
    } state;
} VTMR_tmr_s;
//******************************************************************************


//******************************************************************************
// Секция определения глобальных переменных
//******************************************************************************


//******************************************************************************
// Секция прототипов глобальных функций
extern void VTMR_RestartVirtTimer(VTMR_tmr_s *vTMR);
extern void VTMR_StopVirtTimer(VTMR_tmr_s *vTMR);
extern void VTMR_StartVirtTimer(VTMR_tmr_s *vTMR);
extern uint32_t VTMR_GetValueVirtTimer(VTMR_tmr_s *vTMR);
extern void VTMR_IntProcess(VTMR_tmr_s *vTMR);

void VTMR_StartTimer(
                     VTMR_tmr_s *vTMR);

uint32_t VTMR_GetValueTimer(
                            VTMR_tmr_s *vTMR);
//******************************************************************************


//******************************************************************************
// Секция определения макросов
//******************************************************************************

#endif	/* LIB_A_VTMR_VIRTUAL_TIMERS_H */

////////////////////////////////////////////////////////////////////////////////
// END OF FILE
////////////////////////////////////////////////////////////////////////////////


