/*
 * File:   Lib_A_vtmr_virtual_timers.c
 * Author: m.isaev
 *
 * Created on 4 октября 2017 г., 9:33
 */

//******************************************************************************
// Секция include: здесь подключается заголовочный файл к модулю
#include "Lib_A_VTMR_virtual_timers.h"
//******************************************************************************


//******************************************************************************
//==============================================================================
// Глобальные переменные
//==============================================================================


//==============================================================================
// Локальные переменные
//==============================================================================
//******************************************************************************


//******************************************************************************
// Секция прототипов локальных функций
//******************************************************************************


//******************************************************************************
// Секция описания функций (сначала глобальных, потом локальных)

void VTMR_RestartVirtTimer(
                           VTMR_tmr_s *vTMR)
{
    vTMR->state = RUNNING;
    vTMR->cnt = 0;
}

void VTMR_StopVirtTimer(
                        VTMR_tmr_s *vTMR)
{
    vTMR->state = STOP;
}

void VTMR_StartVirtTimer(
                         VTMR_tmr_s *vTMR)
{
    vTMR->state = RUNNING;
}

uint32_t VTMR_GetValueVirtTimer(
                                VTMR_tmr_s *vTMR)
{
    return vTMR->cnt;
}

void VTMR_IntProcess(
                     VTMR_tmr_s *vTMR)
{
    if (vTMR->state == RUNNING)
    {
        vTMR->cnt++;
    }
}

/**
 * @brief   Функция сбрасывает в нуль виртуальный счетчик;
 * @param[in]   *vTMR:  Указатель на структуру, в которую будет записано 32-х
 *                      битное значение аппаратного счетчика;
 * @return None;
 */
void VTMR_StartTimer(
                     VTMR_tmr_s *pVTMR)
{
    pVTMR->cnt = (uint32_t) (((uint32_t) * pVTMR->pHard16bitCntHight << 16)
            | *pVTMR->pHard16bitCntLow);
}

/**
 * @brief   Функция вычисляет временной интервал между вызовами функции
 *          "VTMR_StartTimer" и "VTMR_GetTimerValue"
 * @param[in,out]   *vTMR:  Указатель на структуру, в одном из полей которой
 *                          записано 32-х битное значение аппаратного счетчика;
 * @return  Временной интервал между вызовами функций "VTMR_StartTimer" и
 *          "VTMR_GetTimerValue" в тиках аппаратного счетчика;
 */
uint32_t VTMR_GetTimerValue(
                            VTMR_tmr_s *pVTMR)
{
    pVTMR->timeInterval = (uint32_t) (((uint32_t) * pVTMR->pHard16bitCntHight << 16)
            | *pVTMR->pHard16bitCntLow)
            - pVTMR->cnt;

    return pVTMR->timeInterval;
}

//******************************************************************************


////////////////////////////////////////////////////////////////////////////////
// END OF FILE
////////////////////////////////////////////////////////////////////////////////
